{
    "directions":[
        "Pour 2 inches of oil in the Le Creuset, turn it up to 8 or 9, it should be 350 F.",
        "Make the salted cabbage: combine cabbage, juice of 1/2 lime and Maldon sea salt. Let it sit for 20 minutes. The cabbage will wilt slightly, but will retain its crunch.",
        "Make the pico de gallo: Combine the tomatoes, onion, and cilantro in a bowl. Season to taste with salt and the remaining lime juice.",
        "Make the lime crema: stir 1 tablespoon lime juice with mayo",
        "Make the fish tacos: combine the flour, beer, a pinch of salt, and the pepper together in a large bowl.",
        "Dredge the fish in the batter and gently place in the hot oil, being careful not to crowd the pot. Fry for 3–4 minutes, turning here and there, until nicely browned. Remove to a paper towel–lined plate, sprinkle with a little salt, and repeat with as many batches as necessary until you've cooked all your fish.",
        "To serve, warm the corn tortillas on both sides in a skillet with just a bit of oil or butter. Serve a stack of them alongside all your fillings. To assemble, spread a spoonful of lime crema on a tortilla, lay 2 or 3 pieces of fried fish on top, scatter generously with pico de gallo, a bit of salted cabbage, and some guacamole."
    ],
    "img_link":"fish_tacos.jpg",
    "ingredients":[
        "1/2 very small green cabbage, coarsely grated",
        "2 lime",
        "Maldon sea salt",
        "Coarse salt",
        "1 pint grape tomatoes, quartered",
        "1/2 small red onion, peeled and very finely diced",
        "2 tablespoons finely chopped fresh cilantro",
        "1 cup unbleached all purpose flour",
        "1 cup beer",
        "1/4 teaspoon freshly ground pepper",
        "1 and 1/2 pounds white fish fillets (cod, pollock, and haddock are all good choices— whatever's best that day), cut into finger-sized pieces(about 2 inches long and 1/2-inch thick)",
        "Corn tortillas",
        "1/2 cup mayo",
        "guacamole",
    ],
    "num_portions":4,
    "preparation_time":"45 mins?",
    "short_desc":"Pretty boss, needs a lot of oil, make sure it's super hot",
    "source":"Gwenyth Paltrow, from My Father's Daughter",
    "title":"Fish Tacos"
}
