{
    "directions":[
	"Heat 1 Tbsp. oil in a large skillet over high heat. Working in batches, add brussels sprout leaves and cook, tossing occasionally, until charred in spots and crisp-tender, about 5 minutes; transfer to a plate and set aside. Wipe out skillet.",
	"Cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente (about 5 minutes for fresh pasta). Drain, reserving 1 cup pasta cooking liquid.",
	"Meanwhile, heat remaining 1 Tbsp. oil in same skillet over medium heat. Add guanciale and cook, stirring often, until slightly crisp, about 4 minutes. Add pepper and cook, stirring, until fragrant, about 30 seconds. Immediately add ½ cup pasta cooking liquid to keep pepper from burning; reduce heat to low and gradually add butter, swirling skillet and adding more pasta cooking liquid as needed, until a thick, glossy sauce forms. (Taste as you go and switch to hot water once sauce is adequately seasoned.)",
	"Add pasta to skillet and toss to coat. Add Pecorino; toss to combine. Remove from heat; mix in egg yolks. Add reserved brussels sprout leaves; toss, adding pasta cooking liquid (or hot water) as needed to thin sauce.",
	"Serve pasta topped with more Pecorino."
    ],
    "img_link":null,
    "ingredients":[
	"1 lb. brussels sprouts, trimmed, leaves separated",
	"12 oz. fresh orecchiette (see Fresh Pasta recipe) or other fresh or dried small pasta",
	"Kosher salt",
	"2 oz. guanciale (salt-cured pork jowl) or pancetta (Italian bacon), finely chopped (about ¼ cup)",
	"½ tsp. coarsely ground black pepper",
	"¼ cup (½ stick) unsalted butter, cut into pieces",
	"⅓ cup grated Pecorino plus more",
	"2 large egg yolks, beaten to blend",
	"2 Tbsp. olive oil, divided"
    ],
    "num_portions":4,
    "preparation_time":"20 mins?",
    "short_desc":"Chef Philip Krajeck, Rolf and Daughters, Nashville, says the key to this dish is getting a good char on the brussels sprouts, which helps balance the richness of the porky, eggy sauce. Salt draws moisture out of the leaves, which might make them soggy, so he doesn’t season them.",
    "source":"http://www.bonappetit.com/recipe/orecchiette-carbonara-with-charred-brussels-sprouts",
    "title":"Orecchiette Carbonara with Charred Brussels Sprouts"
}
