{"ingredients": "2/3 cup almonds\r\n1/2 cup packed light brown sugar\r\n2 1/2 cups all-purpose flour, spooned and leveled, plus more for the work surface\r\n1/2 teaspoon baking powder\r\n1/2 teaspoon kosher salt\r\n1/4 teaspoon ground cinnamon\r\n1 cup (2 sticks) unsalted butter, at room temperature\r\n1 large egg\r\n1 teaspoon pure vanilla extract\r\n1 tablespoon confectioners’ sugar\r\n1 12-ounce jar raspberry jam", "img_link": "", "preparation_time": "", "title": "Raspberry-Almond Linzer Cookies", "short_desc": "like jammy dodgers, made for valentine's day", "source": "http://www.realsimple.com/food-recipes/browse-all-recipes/raspberry-almond-linzer-cookies-00000000046663/", "directions": "Heat oven to 350° F. Spread the almonds on a baking sheet and toast, tossing occasionally, until fragrant, 6 to 8 minutes; let cool.\r\nIn a food processor, process the almonds and ¼ cup of the brown sugar until the almonds are finely ground.\r\nIn a medium bowl, whisk together the flour, baking powder, salt, and cinnamon.\r\nUsing an electric mixer, beat the butter and the remaining ¼ cup brown sugar on medium-high speed until fluffy, 2 to 3 minutes. Beat in the egg and vanilla. Reduce speed to low and gradually add the almond mixture, then the flour mixture, mixing until just combined (do not overmix).\r\nDivide the dough in half, shape into two disks, wrap in plastic wrap, and refrigerate until firm, at least 3 hours.\r\nHeat oven to 350° F. On a lightly-floured surface, roll out each piece of dough to a ⅛-inch thickness. Using a 2- to 2 ½-inch round cookie cutter, cut the dough into rounds and place on parchment-lined baking sheets, spacing them 1 inch apart. Using a ¾- to 1-inch round cookie cutter, cut out the centers from half of the cookies. Reroll and cut the scraps as necessary.\r\nBake, rotating the baking sheets halfway through, until the edges are golden, 10 to 12 minutes. Cool slightly on the baking sheets, then transfer to wire racks to cool completely.\r\nSprinkle the confectioners’ sugar on the cookies with the holes. Spread 1 teaspoon jam on the remaining cookies and top with the sugared cookies. Store the cookies in an airtight container at room temperature for up to 5 days.", "num_portions": ""}