{
    "directions":[
        "Preheat oven to 400 degress",
        "Place the tomatoes in a small baking pan and drizzle with 1\n    tablesppon of the olive oil and a pinch of salt. Roast for 45\n    minutes, stirring occasionally, until they're split and blistered\n    and super sweet",
        "Place the chicken breasts between two pieces of baking\n    parchment paper. Using a mallet, pound the chicken breasts until\n    they're very, very thin - you should almost be able to see through\n    them -- about 1/6-inch thick.",
        "Put the milk in a shallow bowl and the bread crumbs on a\n    large plate. Dip each piece of chicken in to the milk and then\n    dregde it in the bread crumbs, tapping off the excess. You should\n    have a thin, even coating.",
        "Heat 1/4 cup of olive oil in a large nonstick skilet big\n    enough to hold 2 pieces of the chicken in a single layer. Cook for\n    about 4 minutes on the fside, or until evenly browned and crisp.",
        "Flip and cook for an additional 2 or 3 minutes, or until the\n    other side is browned and crisp and the chicken is firm to the\n    touch.",
        "Wipe out the skillet and repeat with the remaining 1/4 cup of\n    olive oil and the remaining 2 pieces of chicken",
        "Toss the arugula with the remaining tablesoon of olive oil,\n    the vinegar and a pinch of salt. Fold the tomatoes into the\n    arugula.",
        "Top the chicken with the tomato and arugula"
    ],
    "img_link":"chicken_milanese_with_cacio_e_pepe.jpg",
    "ingredients":[
        "4 skinless boneless chicken breasts",
        "1 cup milk",
        "2 cups plain bread crumbs (panko is preferred)",
        "1/2 cup plus 2 tablesppons extra virgin olive oil, divided",
        "2 cups cherry tomatoes",
        "coarse salt",
        "2 cups wild arugula",
        "1 tablespoon balsamic vinegar"
    ],
    "num_portions":4,
    "preparation_time":"About 50 minutes",
    "short_desc":"Good summer meal",
    "source":"Gwyneth Paltrow, from My Father's Daughter pg. 146",
    "title":"Slow Roasted Cherry Tomatoes and Arugula Chicken Milanese"
}
