{
    "directions":[
        "Place dark green leek trimmings, asparagus trimmings, 1 cup peas, 2 teaspoons garlic, vetable broth, and water in a large saucpan. Bring to a simmer over high heat, then lower heat to medium-low and gently simmer 10 minutes. While broth simmers, combine mint, chives, and lemon zest in a small bowl; set aside",
	"Straing broth through fine-mesh strainer into 8-cup measuring cup, pressing on solids to extract as much liquid as possible (you should have 5 cups borwth; add water as needed to measure 5 cups). Discard solids and return broth to saucepan. Cover and keep warm over low heat",
	"Heat 2 tablespoons oil in Dutch over over medium heat until shimmering. Add sliced leeks and pinch salt; cook, covered, stirring occasionally, until leeks begin to brwon, about 5 minutes. Add asparagus pieces and cook until crisp-tender, 4 to 6 miuntes. Add remaining 2 teaspoons garlic and pepper flakes; cook until fragrant, about 30 seconds. Add remaining cup peas and continue to cook 1 minute. Transfer vegetables to plate and set aside. Wipe out pot",
	"Heat remaining 4 tablespoons oil in now empty Dutch over over medium heat until shimmering. Add pasta and cook, stirring frequently, until just beginning to brown, about 5 miuntes. Add wine and cook, stirring constantly, until abosorbed, about 2 minutes",
	"When wine is fully absorbed, add hot borth. Increase heat to medium-heihg and br4ing to boil. Cook, stirring frequently, until most of liquid is abosrbed and pasta is al dente. 8 to 10 minutes",
	"Remove pot from heat, stir in lemon jouice, Paresan, half of herb mixture, and vetables. Season with salt and pper to tast. Serve Immediately, passing Parmesan cheese and remaining herb mixture seperately"
    ],
    "img_link":"spring_vegetable_pasta.jpg",
    "ingredients":[
        "3 medium leeks, white and light green parts halved lengthwise, washed, and cut into 1/2-inch thick slices (about 5 cups)",
        "(from leeks above) 3 cups roughly chopped dark green parts",
        "1 pound asparagus, tough ends snapped off, chopped coarsely and reserved",
        "(from asparagus above) spears cut on bias into 1/2-inch thick pieces",
        "2 cups frozen baby peas, thawed",
        "4 medium garlic cloves, minced or pressed through garlic press (about 4 teaspoons)",
        "4 cups vegetable broth",
	"1 cup water",
	"2 tablespoons miced fresh mint leaves",
	"2 tablespoons minced fresh chives",
	"1/2 teaspoon finely grated zest",
	"2 tablespoons juice from 1 lemon",
	"6 tablespoons extra-vigin olive oil",
	"table salt",
	"1/4 teasponn red pepper flakes",
	"1 pound campanelle",
	"1 cup dry white wine",
	"1 ounce grated Parmesan cheese (about 1/2 cup), plus extra for serving",
	"ground black pepper"
    ],
    "num_portions":4,
    "preparation_time":null,
    "short_desc":"Somwhat like a primavera, but not overly creamy sauce",
    "source":"Cook's Illustrated, May/June 2011 pg. 19",
    "title":"Spring Vegetable Pasta"
}
